{"vocab": {"108": 2, "116": 3, "63": 4, "1": 5, "1584": 6, "180": 7, "141": 8, "48": 9, "1594": 10, "36": 11, "1643": 12, "50": 13, "1583": 14, "114": 15, "232": 16, "1577": 17, "1585": 18, "235": 19, "1586": 20, "147": 21, "139": 22, "263": 23, "1168": 24, "127": 25, "156": 26, "168": 27, "135": 28, "158": 29, "110": 30, "1605": 31, "123": 32, "119": 33, "250": 34, "1592": 35, "249": 36, "96": 37, "220": 38, "160": 39, "208": 40, "254": 41, "1603": 42, "277": 43, "273": 44, "214": 45, "1604": 46, "1158": 47, "1597": 48, "610": 49, "73": 50, "77": 51, "1638": 52, "218": 53, "40": 54, "231": 55, "112": 56, "100": 57, "137": 58, "29": 59, "600": 60, "1721": 61, "154": 62, "145": 63, "247": 64, "226": 65, "75": 66, "1808": 67, "2097": 68, "176": 69, "1720": 70, "204": 71, "565": 72, "1806": 73, "603": 74, "692": 75, "166": 76, "1466": 77, "939": 78, "152": 79, "1598": 80, "102": 81, "256": 82, "236": 83, "143": 84, "292": 85, "65": 86, "1576": 87, "43": 88, "267": 89, "90": 90, "1601": 91, "1097": 92, "98": 93, "259": 94, "1596": 95, "1107": 96, "37": 97, "1595": 98, "1599": 99, "149": 100, "950": 101, "71": 102, "41": 103, "1589": 104, "534": 105, "174": 106, "225": 107, "1590": 108, "604": 109, "34": 110, "675": 111, "206": 112, "42": 113, "172": 114, "133": 115, "931": 116, "1719": 117, "242": 118, "26": 119, "11": 120, "252": 121, "21": 122, "1593": 123, "244": 124, "151": 125, "371": 126, "596": 127, "44": 128, "359": 129, "60": 130, "1588": 131, "178": 132, "370": 133, "81": 134, "30": 135, "377": 136, "1581": 137, "947": 138, "598": 139, "121": 140, "279": 141, "840": 142, "117": 143, "1642": 144, "1716": 145, "1640": 146, "16": 147, "210": 148, "1587": 149, "125": 150, "269": 151, "326": 152, "8": 153, "1717": 154, "24": 155, "1637": 156, "1802": 157, "55": 158, "911": 159, "229": 160, "23": 161, "185": 162, "569": 163, "1645": 164, "92": 165, "9": 166, "190": 167, "4206": 168, "20": 169, "1606": 170, "51": 171, "1575": 172, "170": 173, "53": 174, "216": 175, "240": 176, "188": 177, "223": 178, "4204": 179, "1718": 180, "52": 181, "69": 182, "7": 183, "38": 184, "39": 185, "104": 186, "58": 187, "1644": 188, "31": 189, "5": 190, "4205": 191, "79": 192, "162": 193, "32": 194, "237": 195, "485": 196, "61": 197, "13": 198, "129": 199, "22": 200, "203": 201, "1441": 202, "202": 203, "1123": 204, "59": 205, "201": 206, "1122": 207, "54": 208, "265": 209, "181": 210, "56": 211, "473": 212, "67": 213, "215": 214, "14": 215, "17": 216, "1804": 217, "635": 218, "94": 219, "57": 220, "4": 221, "88": 222, "1591": 223, "15": 224, "28": 225, "86": 226, "12": 227, "25": 228, "3": 229, "593": 230, "6": 231, "19": 232, "2": 233, "164": 234, "260": 235, "1125": 236, "261": 237, "18": 238, "33": 239, "27": 240, "1128": 241, "271": 242, "609": 243, "1440": 244, "113": 245, "228": 246, "140": 247, "95": 248, "1154": 249, "115": 250, "175": 251, "248": 252, "122": 253, "47": 254, "109": 255, "35": 256, "157": 257, "148": 258, "134": 259, "245": 260, "118": 261, "241": 262, "207": 263, "97": 264, "270": 265, "111": 266, "612": 267, "1805": 268, "262": 269, "142": 270, "221": 271, "144": 272, "169": 273, "74": 274, "146": 275, "103": 276, "161": 277, "1096": 278, "99": 279, "189": 280, "608": 281, "253": 282, "205": 283, "258": 284, "89": 285, "1106": 286, "234": 287, "126": 288, "230": 289, "184": 290, "607": 291, "101": 292, "255": 293, "606": 294, "533": 295, "233": 296, "179": 297, "1101": 298, "1565": 299, "72": 300, "76": 301, "691": 302, "222": 303, "209": 304}, "duration_bucket_edges": [1168.0, 1293.0, 1394.0, 1500.0, 1629.0, 1798.0, 2042.0], "meta": {"vocab_size": 305, "freq_cutoff": 100, "n_kept": 303, "pad_idx": 0, "rare_idx": 1, "n_total_item_slots": 130183930, "n_unique_item_ids": 329, "top_items_by_freq": [[108, 38194927], [116, 34917990], [63, 33368111], [1, 33011457], [1584, 20405902], [180, 20279076], [141, 19546942], [48, 18550927], [1594, 17057976], [36, 16555675]], "min_freq_kept": 103, "duration": {"n_buckets": 8, "edges": [1168.0, 1293.0, 1394.0, 1500.0, 1629.0, 1798.0, 2042.0], "bucket_counts": [1620650, 1630772, 1619841, 1626411, 1634331, 1627072, 1630965, 1628351], "min": 600, "max": 3600, "p50": 1500}, "walk_seconds": 5.279532194137573, "source": "data/snapshots/7.40-2025-12-16/processed/rich_cols/train.parquet", "smoke": false}}